

let MAP = {
    //数字或小数
    decimals:'^[0-9]+\.{0,1}[0-9]{0,2}$',
    //只能输入数字
    number:'^[0-9]*$',
    //正整数
    positive:'(^[1-9]\d*$)',
    //正小数
    positiveDecimals:'^(([0-9]+\.[0-9]*[1-9][0-9]*)|([0-9]*[1-9][0-9]*\.[0-9]+)|([0-9]*[1-9][0-9]*))$',
    //负小数
    negativeDecimals:'^(-(([0-9]+\.[0-9]*[1-9][0-9]*)|([0-9]*[1-9][0-9]*\.[0-9]+)|([0-9]*[1-9][0-9]*)))$',
    //负整数
    negative:'^\-[1-9][0-9]*$',
    //汉字
    characters:'^[\u4e00-\u9fa5],{0,}$',
    //emai
    email:'^([a-zA-Z0-9]+[_|\_|\.]?)*[a-zA-Z0-9]+@([a-zA-Z0-9]+[_|\_|\.]?)*[a-zA-Z0-9]+\.[a-zA-Z]{2,3}$',
    //url
    url:'^http://([\w-]+\.)+[\w-]+(/[\w-./?%&=]*)?$ ；^[a-zA-z]+://(w+(-w+)*)(.(w+(-w+)*))*(?S*)?$',
    //身份证
    id:'^\d{15}|\d{}18$',
    //手机号
    phone:'^[1][3,4,5,7,8][0-9]{9}$',
    //密码, 字母开头 长度6-18，只能包含字符 数字 和 下划线
    password:'^[a-zA-Z]\w{5,17}$'
}

export default MAP;